{
  "title": "Globale Einstellungen",
  "description": "Konfiguriere globale Einstellungen für deine Instanz.",
  "updatedSuccessfullyMessage": "Einstellungen wurden erfolgreich gespeichert!",
  "randomAliasesPreview": {
    "title": "Zufällige Aliase werden so aussehen",
    "helperText": "Dies ist nur eine Vorschau. Dies sind keine echten Aliase."
  },
  "randomAliasesIncreaseExplanation": "Die Länge der Adressen von zufälligen Aliase wird von {{originalLength}} auf {{increasedLength}} Zeichen erhöht, nachdem {{amount}} Aliase erstellt wurden.",
  "resetLabel": "Auf Standards zurücksetzen",
  "disabled": {
    "title": "Globale Einstellungen sind deaktiviert",
    "description": "Globale Einstellungen wurden deaktiviert. Du kannst sie in der Konfigurationsdatei aktivieren."
  },
  "fields": {
    "randomEmailIdMinLength": {
      "label": "Minimale Länge zufällier Alias-Adressen",
      "description": "Die minimale Länge für zufällig generierte E-Mail-Adressen. Der Server wird die Länge automatisch erhöhen, wenn dies erforderlich ist."
    },
    "randomEmailIdChars": {
      "label": "Zeichen zufälliger Alias-Adressen",
      "description": "Zeichen, die für die Generierung von zufälligen E-Mail-Adressen verwendet werden."
    },
    "randomEmailLengthIncreaseOnPercentage": {
      "label": "Prozent der zu verwendeten Aliase",
      "description": "Wenn der Prozentsatz der verwendeten zufälligen E-Mail-Adressen höher als dieser Wert ist, wird die Länge der zufälligen E-Mail-Adressen erhöht. Dies wird verwendet, um Spammern das Erraten von Aliasen zu erschweren."
    },
    "customEmailSuffixLength": {
      "label": "Länge benutzerdefinierter E-Mail-Suffixe",
      "description": "Die Länge des benutzerdefinierten E-Mail-Suffixes."
    },
    "customEmailSuffixChars": {
      "label": "Zeichen benutzerdefinierte E-Mail-Suffixe",
      "description": "Zeichen, die für die Generierung von benutzerdefinierten E-Mail-Suffixen verwendet werden."
    },
    "imageProxyStorageLifeTimeInHours": {
      "label": "Lebensdauer von Bildweiterleitungen",
      "description": "Die Lebensdauer von Bildern, die auf dem Server gespeichert sind, in Stunden. Nach dieser Zeit wird das Bild gelöscht.",
      "unit_one": "Stunde",
      "unit_other": "Stunden"
    },
    "enableImageProxy": {
      "label": "Weiterleitung von Bildern aktivieren",
      "description": "Wenn aktiviert, werden Bilder über den Server weitergeleitet. Dies erhöht die Privatsphäre deiner Benutzer, da ihre IP-Adresse nicht getracked werden können."
    },
    "enableImageProxyStorage": {
      "label": "Speichern von Bildern aktivieren",
      "description": "Wenn aktiviert, werden Bilder auf dem Server gespeichert und an den Benutzer weitergeleitet. Dies macht das Tracking von E-Mails fast unmöglich, da jede Nachricht sofort als gelesen markiert wird, was natürlich nicht wahr ist, da ein Benutzer normalerweise nicht in wenigen Sekunden nach dem Versand einer E-Mail diese bereits öffnen kann. Dies betrifft nur neue Bilder."
    },
    "userEmailEnableDisposableEmails": {
      "label": "Erlauben von Wegwerf-E-Mails für neue Konten",
      "description": "Wenn aktiviert, können Benutzer bei der Erstellung eines neuen Kontos Wegwerf-E-Mails verwenden. Dies betrifft nur neue Konten."
    },
    "userEmailEnableOtherRelays": {
      "label": "Erlauben von anderen E-Mail-Alias-Providern für neue Konten",
      "description": "Wenn aktiviert, können Benutzer bei der Erstellung eines neuen Kontos andere E-Mail-Weiterleitungen (wie SimpleLogin oder DuckDuckGo's Email Tracking Protection) verwenden. Dies betrifft nur neue Konten."
    },
    "allowStatistics": {
      "label": "Statistiken aktivieren",
      "description": "Wenn aktiviert, sammelt deine Instanz anonyme Statistiken und teilt sie. Sie werden nur lokal auf dieser Instanz gespeichert, aber öffentlich gemacht."
    },
    "allowAliasDeletion": {
      "label": "Löschen von Aliasen erlauben",
      "description": "Wenn aktiviert, können Benutzer ihre Aliase löschen."
    },
    "maxAliasesPerUser": {
      "label": "Maximale Anzahl von Aliase pro Benutzer",
      "description": "Die maximale Anzahl von Aliase, die ein Benutzer erstellen kann. 0 bedeutet unbegrenzt. Bestehende Aliase werden nicht gelöscht, wenn der Benutzer die maximale Anzahl von Aliase erreicht hat."
    }
  }
}
